---
kind: type
id: T:Autodesk.Revit.DB.Visual.HardwoodApplicationType
source: html/0e8a5ad4-9bd7-afb5-6075-fe28da88f394.htm
---
# Autodesk.Revit.DB.Visual.HardwoodApplicationType

The enumerated type representing the permitted values for the asset property "HardwoodApplication" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public enum HardwoodApplicationType
```